---
kind: method
id: M:Autodesk.Revit.DB.DividedPath.IsValidSpacingRuleJustification(Autodesk.Revit.DB.SpacingRuleJustification)
source: html/6e459f58-641a-25b8-affb-19a220ec662e.htm
---
# Autodesk.Revit.DB.DividedPath.IsValidSpacingRuleJustification Method

Checks that the justification enumeration value is valid

## Syntax (C#)
```csharp
public bool IsValidSpacingRuleJustification(
	SpacingRuleJustification justification
)
```

## Parameters
- **justification** (`Autodesk.Revit.DB.SpacingRuleJustification`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration